unit-04-unsupervised-learning/04-02-lecture-14-clustering-02/u04-l14-01-clustering-lecture-02.org
#+STARTUP: showall
#+STARTUP: inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+AUTHOR: Tabaré Pérez
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper, 12pt]
#+LATEX_HEADER: \usepackage{float, amsfonts, commath, mathtools}
#+TITLE: Lecture 14 - 1: Clustering Lecture 2
* Objectives:
- Understand the limitations of the K-Means algorithm
- Understand how K-Medoids algorithm is different from the K-Means algorithm
- Understand the computational complexity of the K-Means and the K-Medoids
  algorithms
- Understand the importance of choosing the right number of clusters
- Understand elements that can be supervised in unsupervised learning
