unit-04-unsupervised-learning/04-02-lecture-14-clustering-02/u04-l14-01-clustering-lecture-02.tex
% Created 2020-05-06 mié 13:53
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{float, amsfonts, commath, mathtools}
\author{Tabaré Pérez}
\date{\today}
\title{Lecture 14 - 1: Clustering Lecture 2}
\hypersetup{
 pdfauthor={Tabaré Pérez},
 pdftitle={Lecture 14 - 1: Clustering Lecture 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Objectives:}
\label{sec:org51bc25b}
\begin{itemize}
\item Understand the limitations of the K-Means algorithm
\item Understand how K-Medoids algorithm is different from the K-Means algorithm
\item Understand the computational complexity of the K-Means and the K-Medoids
algorithms
\item Understand the importance of choosing the right number of clusters
\item Understand elements that can be supervised in unsupervised learning
\end{itemize}
\end{document}
